Revit 2024 API
AlphanumericRevisionSettings.IsEqual Method
 Determines whether a specified AlphanumericRevisionSettings is the same as 'this'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsEqual(
	AlphanumericRevisionSettings other
)
Visual Basic
Public Function IsEqual ( _
	other As AlphanumericRevisionSettings _
) As Boolean
Visual C++
public:
bool IsEqual(
	AlphanumericRevisionSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.AlphanumericRevisionSettings
 The AlphanumericRevisionSettings object to be compared with 'this'.
Return Value
 True, if two AlphanumericRevisionSettings are the same.
Remarks
 The two AlphanumericRevisionSettings are regarded as the same only if they have the same revision numbering sequence, and the same prefix and suffix strings.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace